In [1]:
import pandas as pd

pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], index=["a", "b", "c"], columns=["x","y","z"])

   x  y  z
a  1  2  3
b  4  5  6
c  7  8  9

In [2]:
df = pd.read_csv("titanic.csv")
df.info()
print("")
print(df.shape)
print("")
print(df.dtypes)
print("")
print(df.columns)
print("")
print(df.index)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

(891, 12)

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

RangeIndex(start=0, stop=891, step=1)

In [3]:
df[["Age", "Name"]]

      Age                                               Name
0    22.0                            Braund, Mr. Owen Harris
1    38.0  Cumings, Mrs. John Bradley (Florence Briggs Th...
2    26.0                             Heikkinen, Miss. Laina
3    35.0       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4    35.0                           Allen, Mr. William Henry
..    ...                                                ...
886  27.0                              Montvila, Rev. Juozas
887  19.0                       Graham, Miss. Margaret Edith
888   NaN           Johnston, Miss. Catherine Helen "Carrie"
889  26.0                              Behr, Mr. Karl Howell
890  32.0                                Dooley, Mr. Patrick

[891 rows x 2 columns]

In [4]:
df[100:105]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
100,101,0,3,"Petranec, Miss. Matilda",female,28.0,0,0,349245,7.8958,NaN,S
101,102,0,3,"Petroff, Mr. Pastcho (""Pentcho"")",male,NaN,0,0,349215,7.8958,NaN,S
102,103,0,1,"White, Mr. Richard Frasar",male,21.0,0,1,35281,77.2875,D26,S
103,104,0,3,"Johansson, Mr. Gustaf Joel",male,33.0,0,0,7540,8.6542,NaN,S
104,105,0,3,"Gustafsson, Mr. Anders Vilhelm",male,37.0,2,0,3101276,7.9250,NaN,S

In [5]:
df.loc[100:105, ["Age", "Name"]]

      Age                              Name
100  28.0           Petranec, Miss. Matilda
101   NaN  Petroff, Mr. Pastcho ("Pentcho")
102  21.0         White, Mr. Richard Frasar
103  33.0        Johansson, Mr. Gustaf Joel
104  37.0    Gustafsson, Mr. Anders Vilhelm
105  28.0             Mionoff, Mr. Stoytcho

In [6]:
df.loc[[300, 255], "Embarked"]

300    Q
255    C
Name: Embarked, dtype: object

In [7]:
df.iloc[125,4]

'male'

In [8]:
df.iloc[[23,30], [2,5]]

    Pclass   Age
23       1  28.0
30       1  40.0

In [9]:
df.iloc[100:108, -3:]

        Fare Cabin Embarked
100   7.8958   NaN        S
101   7.8958   NaN        S
102  77.2875   D26        S
103   8.6542   NaN        S
104   7.9250   NaN        S
105   7.8958   NaN        S
106   7.6500   NaN        S
107   7.7750   NaN        S

In [10]:
df.loc[df["Age"]>=70, ["Name", "Sex"]]

                                     Name   Sex
96              Goldschmidt, Mr. George B  male
116                  Connors, Mr. Patrick  male
493               Artagaveytia, Mr. Ramon  male
630  Barkworth, Mr. Algernon Henry Wilson  male
672           Mitchell, Mr. Henry Michael  male
745          Crosby, Capt. Edward Gifford  male
851                   Svensson, Mr. Johan  male

In [27]:
s1 = pd.DataFrame([1,2,3,4,5,6])
s2 = pd.DataFrame([7,8,9,10,11,12])

s2.rename(index={"1":"3","2":"4","3":"5", "6":"9","7":"10","8":"11"}, inplace=True)

    0
0   8
1  10
2  12
3  14
4  16
5  18